In [ ]:
import numpy as np
import pandas as pd

In [ ]:
my_index1 = ['USA', 'CANADA', 'MEXICO']
my_column1 = ['Year', 'Pop']
my_data1 = [[1776, 328],
           [1867, 38],
           [1821, 126]]
df1 =  pd.DataFrame(my_data1, my_index1, my_column1 )

In [ ]:
df1

In [ ]:
my_index2 = ['USA', 'CANADA', 'MEXICO']
my_column2 = ['GDP', 'Perct']
my_data2 = [[20.5, 75],
           [1.7, np.nan],
           [1.22, 25]]
df2 =  pd.DataFrame(my_data2, my_index2, my_column2 )

In [ ]:
df2

In [ ]:
pd.concat([df1, df2], axis = 1)

In [ ]:
data_one = {'A':['A0', 'A1', 'A3', 'A4'],'B': ['B0', 'B1', 'B2','B3']}
one = pd.DataFrame(data_one)

In [ ]:
one

In [ ]:
data_two = {'C':['C0', 'C1', 'C3', 'C4'],'D': ['D0', 'D1', 'D2','D3']}
two = pd.DataFrame(data_two)

In [ ]:
one
two

In [ ]:
two.columns = one.columns

In [ ]:
two

In [ ]:
mydf = pd.concat([one, two], axis = 0)

In [ ]:
mydf

In [ ]:
mydf.index = range(len(mydf))

In [ ]:
mydf

#MERGE

In [22]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [23]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [24]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [25]:
pd.merge(registrations, logins, how= 'inner', on = 'name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [26]:
pd.merge(registrations, logins, how = 'left', on ='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [28]:
pd.merge(registrations, logins, how = 'right', on = 'name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [29]:
pd.merge(registrations, logins, how='outer', on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [37]:
registrations

   reg_name  reg_id
0         1  Andrew
1         2    Bobo
2         3  Claire
3         4   David

In [33]:
registrations = registrations.rename(columns={'name' :'reg_name'})

In [36]:
registrations

   reg_name  reg_id
0         1  Andrew
1         2    Bobo
2         3  Claire
3         4   David